import { han2numberFormat } from '../index';
import { numberToChinese } from '../util';
import { expect } from 'chai';
describe('更新纯文本', () => {
  it('万以内', () => {
    for (let i = 0; i < 10000; i++) {
      const str = numberToChinese(i);
      const result = han2numberFormat(str);
      expect(`${i}`).eq(result);
    }
  });
  it('[Intl]zh-Hans-CN-u-nu-hanidec', () => {
    const nf = new Intl.NumberFormat('zh-Hans-CN-u-nu-hanidec', {
      useGrouping: false,
    });
    for (let i = 0; i < 10000; i++) {
      const str = nf.format(i);
      const result = han2numberFormat(str);
      expect(`${i}`).eq(result);
    }
  });
  it('整数通用', () => {
    const list = [
      ['一', 1],
      ['一十', 10],
      ['一十二', 12],
      ['一百二十三', 123],
      ['一千二百三十四', 1234],
      ['一万二千三百四十五', 12345],
      ['一十二万三千四百五十六', 123456],
      ['一百二十三万四千五百六十七', 1234567],
      ['一千二百三十四万五千六百七十八', 12345678],
      ['一亿二千三百四十五万六千七百八十九', 123456789],
      ['一十二亿三千四百五十六万七千八百九十', 1234567890],
      ['一百二十三亿零一百二十三万零一百二十三', 12301230123],
      ['一千二百三十亿一千二百三十万一千二百三十', 123012301230],
      ['一万二千三百零一亿二千三百零一万二千三百零一', 1230123012301],
      ['一十二万三千零一十二亿三千零一十二万三千零一十二', 12301230123012],
      ['一亿亿', 10000000000000000],
    ] as const;
    for (const [ch, num] of list) {
      const result = han2numberFormat(ch);
      expect(`${num}`).eq(result, `字符串:${ch},数字:${result},理论上:${num}`);
    }
  });
  it('带零', () => {
    const list = [
      ['零', 0],
      ['一百零一', 101],
      ['一千零一', 1001],
      ['一万零一', 10001],
      ['一十万零一', 100001],
      ['一十万零一十', 100010],
      ['一十万零一百', 100100],
      ['一十万一千', 101000],
      ['一十亿一千万一千', 1010001000],
      ['一十亿零一千', 1000001000],
      ['一万零五', 10005],
      ['一万零五百', 10500],
      ['一万零五十', 10050],
      ['一百万零五十', 1000050],
      ['一百万零五千零五十', 1005050],
    ] as const;
    for (const [ch, num] of list) {
      const result = han2numberFormat(ch);
      expect(`${num}`).eq(result, `字符串:${ch},数字:${result},理论上:${num}`);
    }
  });
  it('十测试', () => {
    const list = [
      ['十', 10],
      ['十五', 15],
      ['十万', 100000],
      ['十万零一十', 100010],
      ['十亿零十万', 1000100000],
    ] as const;
    for (const [ch, num] of list) {
      const result = han2numberFormat(ch);
      expect(`${num}`).eq(result, `字符串:${ch},数字:${result},理论上:${num}`);
    }
  });
  it('混合其他字符', () => {
    const list = [
      ['第一百二十三章', `第123章`],
      ['第123章', `第123章`],
      ['第一二三章', `第123章`],
      ['第一二零章', `第120章`],
      ['第零章', `第0章`],
      ['第一零零章', `第100章`],
      ['第一零零一章', `第1001章`],
    ] as const;
    for (const [ch, value] of list) {
      const result = han2numberFormat(ch);
      expect(value).eq(result, `字符串:${ch},数字:${result},理论上:${value}`);
    }
  });
  it('其他', () => {
    const list = [
      [
        '九千八百七十六万五千四百三十二亿九千八百七十六万五千四百三十二',
        `9876543298765432`,
      ],
      ['三千一百万零五十四', `31000054`],
      ['一百万零五十四', `1000054`],
      ['第一二零章', `第120章`],
      ['第零章', `第0章`],
      ['第一零零章', `第100章`],
      ['第一零零一章', `第1001章`],

      ['零', 0],
      ['一', 1],
      ['十', 10],
      ['十一', 11],
      ['一十一', 11],
      ['二十', 20],
      ['二十一', 21],
      ['一百', 100],
      ['一百零一', 101],
      ['一百一十', 110],
      ['一百一十一', 111],
      ['一千', 1000],
      ['一千一百', 1100],
      ['一千一百一十', 1110],
      ['一千一百一十一', 1111],
      ['一千零一十', 1010],
      ['一千零十', 1010],
      ['一千零十一', 1011],
      ['一千零一十一', 1011],
      ['一千零一', 1001],
      ['一千一百零一', 1101],
      ['一万一千一百一十一', 11111],
      ['一十一万一千一百一十一', 111111],
      ['一百一十一万一千一百一十一', 1111111],
      ['一千一百一十一万一千一百一十一', 11111111],
      ['一亿一千一百一十一万一千一百一十一', 111111111],
      ['一十一亿一千一百一十一万一千一百一十一', 1111111111],
      ['一百一十一亿一千一百一十一万一千一百一十一', 11111111111],
      ['一千一百一十一亿一千一百一十一万一千一百一十一', 111111111111],
      [
        '一千一百一十一万一千一百一十一亿一千一百一十一万一千一百一十一',
        1111111111111111,
      ],
      ['壹', 1],
      ['拾', 10],
      ['拾壹', 11],
      ['壹拾壹', 11],
      ['壹佰壹拾壹', 111],
      ['壹仟壹佰壹拾壹', 1111],
      ['壹万壹仟壹佰壹拾壹', 11111],
      ['壹拾壹万壹仟壹佰壹拾壹', 111111],
      ['壹佰壹拾壹万壹仟壹佰壹拾壹', 1111111],
      ['壹仟壹佰壹拾壹万壹仟壹佰壹拾壹', 11111111],
      ['壹亿壹仟壹佰壹拾壹万壹仟壹佰壹拾壹', 111111111],
      ['壹拾壹亿壹仟壹佰壹拾壹万壹仟壹佰壹拾壹', 1111111111],
      ['壹佰壹拾壹亿壹仟壹佰壹拾壹万壹仟壹佰壹拾壹', 11111111111],
      ['壹仟壹佰壹拾壹亿壹仟壹佰壹拾壹万壹仟壹佰壹拾壹', 111111111111],
      ['壹拾壹元整', `11元整`],
      ['壹佰壹拾壹圆整', `111圆整`],
      ['壹拾壹元正', `11元正`],
      ['壹拾壹圆正', `11圆正`],
      ['十万', 100000],
      ['十万零一', 100001],
      ['一万零一', 10001],
      ['一万零一十一', 10011],
      ['一万零一百一十一', 10111],
      ['一万零百一十一', 10111],
      ['一十万零一', 100001],
      ['一百万零一', 1000001],
      ['一千万零一', 10000001],
      ['一千零一万一千零一', 10011001],
      ['一千零一万零一', 10010001],
      ['一亿零一', 100000001],
      ['一十亿零一', 1000000001],
      ['一百亿零一', 10000000001],
      ['一千零一亿一千零一万一千零一', 100110011001],
      ['一千亿一千万一千零一', 100010001001],
      ['一千亿零一', 100000000001],
      ['', ''],
    ] as const;
    for (const [ch, value] of list) {
      const result = han2numberFormat(ch);
      expect(`${value}`).eq(
        result,
        `字符串:${ch},数字:${result},理论上:${value}`,
      );
    }
  });

  // it.only('测试', () => {
  //   const list = [['十亿零十万', 1000100000]] as const;
  //   for (const [ch, num] of list) {
  //     let result = han2numberFormat(ch);
  //     expect(`${num}`).eq(result, `字符串:${ch},数字:${result},理论上:${num}`);
  //   }
  // });
  it('非常规情况', () => {
    const list = [
      ['万万岁', `${10 ** 8}岁`],
      ['万岁爷', `${10 ** 4}岁爷`],
      ['千百万年以来', `${10 ** 9}年以来`],
      // 是不是变成991更好?
      ['九十九一', `${100}`],
      ['二一添作五', `21添作5`],
      ['无数字', `无数字`],
    ] as const;
    for (const [ch, num] of list) {
      const result = han2numberFormat(ch);
      expect(`${num}`).eq(result, `字符串:${ch},数字:${result},理论上:${num}`);
    }
  });
});
